IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM5_CONTROLSS_G3_EPWM5.xml
	<register id="CONTROLSS_G3_EPWM5_GLDCTL" acronym="CONTROLSS_G3_EPWM5_GLDCTL" offset="0x68" width="16" description="Global PWM Load Control Register">
		<bitfield id="GLDCNT" width="3" begin="12" end="10" resetval="0x0" description="Global Load Strobe Counter Register  These bits indicate how many selected events have occurred:    000: No events  001: 1 event  010: 2 events  011: 3 events  100: 4 events  101: 5 events  110: 6 events  111: 7 events" range="12 - 10" rwaccess="R"/> 
		<bitfield id="GLDPRD" width="3" begin="9" end="7" resetval="0x0" description="Global Load Strobe Period Select Register  These bits select how many selected events need to occur before a load strobe is generated   000: Disable counter  001: Generate strobe on GLDCNT = 001 [1st event]  010: Generate strobe on GLDCNT = 010 [2nd event]  011: Generate strobe on GLDCNT = 011 [3rd event]  100: Generate strobe on GLDCNT = 011 [4th event]  101: Generate strobe on GLDCNT = 001 [5th event]  110: Generate strobe on GLDCNT = 010 [6th event]  111: Generate strobe on GLDCNT = 011 [7th event]" range="9 - 7" rwaccess="R/W"/> 
		<bitfield id="OSHTMODE" width="1" begin="5" end="5" resetval="0x0" description="One Shot Load Mode Control Bit   0: One shot load mode is disabled and shadow to active loading happens continuously on all the chosen load strobes.  1: One shot mode is active. All load strobes are blocked until GLDCTL2[OSHTLD] is written with 1.   Note: One Shot mode can only be used with global shadow to active load mode enabled [GLDCTL[GLD]=1]" range="5" rwaccess="R/W"/> 
		<bitfield id="GLDMODE" width="4" begin="4" end="1" resetval="0x0" description="Global Load Pulse selection for Shadow to Active Mode Reloads   0000: Load on Counter = 0 [CNT_ZRO]  0001: Load on Counter = Period [PRD_EQ]  0010: Load on either Counter = 0, or Counter = Period  0011: Load on SYNCEVT - this is logical OR of DCAEVT1.sync, DCBEVT1.sync, EPWMxSYNCI and TBCTL[SWFSYNC]  0100: Load on SYNCEVT or CNT_ZRO  0101: Load on SYNCEVT or PRD_EQ  0110: Load on SYNCEVT or CNT_ZRO or PRD_EQ  1000: Load on Counter = CMPCU [CMPC_EQ counter incrementing]  1001: Load on Counter = CMPCD [CMPC_EQ counter decrementing]  1010: Load on Counter = CMPDU [CMPD_EQ counter incrementing]  1011: Load on Counter = CMPDD [CMPD_EQ counter decrementing]  1100: Reserved  ...  1110: Reserved  1111: Load on GLDCTL2[GFRCLD] write" range="4 - 1" rwaccess="R/W"/> 
		<bitfield id="GLD" width="1" begin="0" end="0" resetval="0x0" description="Global Shadow to Active Load Event Control   0: Shadow to active reload for all shadowed registers happens as per the individual reload control bits specified [Compatible with previous EPWM versions].   1: When set, all the shadow to active reload events are defined by GLDMODE bits in GLDCTL register. All the shadow registers use same reload pulse from shadow to active reloading. Individual LOADMODE bits are ignored." range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM5_GLDCFG" acronym="CONTROLSS_G3_EPWM5_GLDCFG" offset="0x6A" width="16" description="Global PWM Load Config Register ">
		<bitfield id="AQCSFRC" width="1" begin="10" end="10" resetval="0x0" description="Global load event configuration for AQCSFRC   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="10" rwaccess="R/W"/> 
		<bitfield id="AQCTLB_AQCTLB2" width="1" begin="9" end="9" resetval="0x0" description="Global load event configuration for AQCTLB_AQCTLB2   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="9" rwaccess="R/W"/> 
		<bitfield id="AQCTLA_AQCTLA2" width="1" begin="8" end="8" resetval="0x0" description="Global load event configuration for AQCTLA_AQCTLA2   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="8" rwaccess="R/W"/> 
		<bitfield id="DBCTL" width="1" begin="7" end="7" resetval="0x0" description="Global load event configuration for DBCTL   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="7" rwaccess="R/W"/> 
		<bitfield id="DBFED_DBFEDHR" width="1" begin="6" end="6" resetval="0x0" description="Global load event configuration for DBFED_DBFEDHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="6" rwaccess="R/W"/> 
		<bitfield id="DBRED_DBREDHR" width="1" begin="5" end="5" resetval="0x0" description="Global load event configuration for DBRED_DBREDHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="5" rwaccess="R/W"/> 
		<bitfield id="CMPD" width="1" begin="4" end="4" resetval="0x0" description="Global load event configuration for CMPD   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="4" rwaccess="R/W"/> 
		<bitfield id="CMPC" width="1" begin="3" end="3" resetval="0x0" description="Global load event configuration for CMPC   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="3" rwaccess="R/W"/> 
		<bitfield id="CMPB_CMPBHR" width="1" begin="2" end="2" resetval="0x0" description="Global load event configuration for CMPB_CMPBHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="2" rwaccess="R/W"/> 
		<bitfield id="CMPA_CMPAHR" width="1" begin="1" end="1" resetval="0x0" description="Global load event configuration for CMPA_CMPAHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="1" rwaccess="R/W"/> 
		<bitfield id="TBPRD_TBPRDHR" width="1" begin="0" end="0" resetval="0x0" description="Global load event configuration for TBPRD_TBPRDHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="0" rwaccess="R/W"/>
	</register>
