IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM5_CONTROLSS_G3_EPWM5.xml
	<register id="CONTROLSS_G3_EPWM5_XREGSHDW3STS" acronym="CONTROLSS_G3_EPWM5_XREGSHDW3STS" offset="0x430" width="32" description="Shadow Buffer 3 Update Status Register">
		<bitfield id="XMIN_SHDW3FULL" width="1" begin="14" end="14" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="14" rwaccess="R"/> 
		<bitfield id="XMAX_SHDW3FULL" width="1" begin="13" end="13" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="13" rwaccess="R"/> 
		<bitfield id="XAQCTLB_SHDW3FULL" width="1" begin="12" end="12" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="12" rwaccess="R"/> 
		<bitfield id="XAQCTLA_SHDW3FULL" width="1" begin="11" end="11" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="11" rwaccess="R"/> 
		<bitfield id="CMPD_SHDW3FULL" width="1" begin="10" end="10" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="10" rwaccess="R"/> 
		<bitfield id="CMPC_SHDW3FULL" width="1" begin="9" end="9" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="9" rwaccess="R"/> 
		<bitfield id="XTBPRD_SHDW3FULL" width="1" begin="8" end="8" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="8" rwaccess="R"/> 
		<bitfield id="XCMP8_SHDW3FULL" width="1" begin="7" end="7" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="7" rwaccess="R"/> 
		<bitfield id="XCMP7_SHDW3FULL" width="1" begin="6" end="6" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="6" rwaccess="R"/> 
		<bitfield id="XCMP6_SHDW3FULL" width="1" begin="5" end="5" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="5" rwaccess="R"/> 
		<bitfield id="XCMP5_SHDW3FULL" width="1" begin="4" end="4" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="4" rwaccess="R"/> 
		<bitfield id="XCMP4_SHDW3FULL" width="1" begin="3" end="3" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="3" rwaccess="R"/> 
		<bitfield id="XCMP3_SHDW3FULL" width="1" begin="2" end="2" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="2" rwaccess="R"/> 
		<bitfield id="XCMP2_SHDW3FULL" width="1" begin="1" end="1" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="1" rwaccess="R"/> 
		<bitfield id="XCMP1_SHDW3FULL" width="1" begin="0" end="0" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM5_XCMP1_ACTIVE" acronym="CONTROLSS_G3_EPWM5_XCMP1_ACTIVE" offset="0x600" width="32" description="Additional Compare 1 Active Register">
		<bitfield id="XCMP1_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP1_ACTIVE Register The value in the XCMP1_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP1HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP1HR_ACTIVE Register  The value in the XCMP1HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM5_XCMP2_ACTIVE" acronym="CONTROLSS_G3_EPWM5_XCMP2_ACTIVE" offset="0x604" width="32" description="Additional Compare 2 Active Register">
		<bitfield id="XCMP2_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP2_ACTIVE Register The value in the XCMP2_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP2HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP2HR_ACTIVE Register  The value in the XCMP2HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM5_XCMP3_ACTIVE" acronym="CONTROLSS_G3_EPWM5_XCMP3_ACTIVE" offset="0x608" width="32" description="Additional Compare 3 Active Register">
		<bitfield id="XCMP3_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP3_ACTIVE Register The value in the XCMP3_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP3HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP3HR_ACTIVE Register  The value in the XCMP3HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM5_XCMP4_ACTIVE" acronym="CONTROLSS_G3_EPWM5_XCMP4_ACTIVE" offset="0x60C" width="32" description="Additional Compare 4 Active Register">
		<bitfield id="XCMP4_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP4_ACTIVE Register The value in the XCMP4_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP4HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP4HR_ACTIVE Register  The value in the XCMP4HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM5_XCMP5_ACTIVE" acronym="CONTROLSS_G3_EPWM5_XCMP5_ACTIVE" offset="0x610" width="32" description="Additional Compare 5 Active Register">
		<bitfield id="XCMP5_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP5_ACTIVE Register The value in the XCMP5_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP5HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP5HR_ACTIVE Register  The value in the XCMP5HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM5_XCMP6_ACTIVE" acronym="CONTROLSS_G3_EPWM5_XCMP6_ACTIVE" offset="0x614" width="32" description="Additional Compare 6 Active Register">
		<bitfield id="XCMP6_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP6_ACTIVE Register The value in the XCMP6_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP6HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP6HR_ACTIVE Register  The value in the XCMP6HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM5_XCMP7_ACTIVE" acronym="CONTROLSS_G3_EPWM5_XCMP7_ACTIVE" offset="0x618" width="32" description="Additional Compare 7 Active Register">
		<bitfield id="XCMP7_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP7_ACTIVE Register The value in the XCMP7_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP7HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP7HR_ACTIVE Register  The value in the XCMP7HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM5_XCMP8_ACTIVE" acronym="CONTROLSS_G3_EPWM5_XCMP8_ACTIVE" offset="0x61C" width="32" description="Additional Compare 8 Active Register">
		<bitfield id="XCMP8_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP8_ACTIVE Register The value in the XCMP8_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP8HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP8HR_ACTIVE Register  The value in the XCMP8HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM5_XTBPRD_ACTIVE" acronym="CONTROLSS_G3_EPWM5_XTBPRD_ACTIVE" offset="0x620" width="32" description="Additional Time Base Period Active Register">
		<bitfield id="XTBPRD_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="The value in the XTBPRD_ACTIVE register is loaded into TBPRD [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XTBPRDHR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="The value in the XTBPRDHR_ACTIVE register is loaded into TBPRDHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM5_XAQCTLA_ACTIVE" acronym="CONTROLSS_G3_EPWM5_XAQCTLA_ACTIVE" offset="0x630" width="16" description="AQCTLA Active Register">
		<bitfield id="XCMP8" width="2" begin="15" end="14" resetval="0x0" description="Action when Counter = CMP8 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="XCMP7" width="2" begin="13" end="12" resetval="0x0" description="Action when Counter = CMP7 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="XCMP6" width="2" begin="11" end="10" resetval="0x0" description="Action when Counter = CMP6 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="XCMP5" width="2" begin="9" end="8" resetval="0x0" description="Action when Counter = CMP5 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="XCMP4" width="2" begin="7" end="6" resetval="0x0" description="Action when Counter = CMP4 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="XCMP3" width="2" begin="5" end="4" resetval="0x0" description="Action when Counter = CMP3 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="XCMP2" width="2" begin="3" end="2" resetval="0x0" description="Action when Counter = CMP2 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="XCMP1" width="2" begin="1" end="0" resetval="0x0" description="Action when Counter = CMP1 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="1 - 0" rwaccess="R/W"/>
	</register>
